import React from "react";

const Home = () => {
  return (
    <div>
      <section>
        <span>دسترسی به گزارشات اعتباری حقیقی و حقوقی</span>
        <h1>سامانه اعتبار من</h1>
        <p>
          بانک‌ها، موسسات مالی اعتباری، بنگاه‌های اقتصادی و ... امروزه برای سنجش
          اعتبار شما و اینکه بدانند مشتریانشان تا چه حد خوش حساب هستند، از
          گزارشات اعتباری استفاده می‌نمایند. شما با استفاده از سامانه اعتبار من
          می‌توانید به راحتی و در کمترین زمان این گزارش را دریافت نموده و میزان
          اعتبار خود را در نزد آنها مشاهده نمایید.
        </p>
        <div>
          <button>دریافت گزارش اعتباری</button>
          <button>رتبه اعتباری چیست؟</button>
        </div>
      </section>
      <section>
        <h2>رتبه اعتباری چیست؟</h2>
        <p>
          امروزه یکی از ملاک‌های پرداخت وام در بانک‌ها و موسسات مالی اعتباری،
          رتبه اعتباری می‌باشد. در حال حاضر هر فرد که اقدام به دریافت تسهیلات
          می‌کند، توسط بانک یا موسسه اعطا کننده تسهیلات بعنوان یک شرط لازم
          دریافت وام، ‌اعتبارسنجی می‌شود.
        </p>
        <p>
          رتبه اعتباری مشخص کننده خوش حسابی شما (حقیقی یا حقوقی) در نزد
          بنگاه‌های اقتصادی است. پرداخت به موقع اقساط تسهیلات بصورت منظم و عدم
          وجود بدهی مالیاتی، رتبه اعتباری شما را بهبود بخشیده و آن را ارتقا
          می‌دهد.
        </p>
        <p>
          مطالبه رتبه اعتباری از افراد حقیقی و حقوقی، سبب کاهش خطر کلاه‌برداری و
          ریسک اعطای تسهیلات، سرمایه‌گذاری و معاملات می‌شود.
        </p>
        <p>
          شما می‌توانید با استفاده از خدمات سامانه اعتبار من به راحتی و در
          کمترین زمان رتبه اعتباری خود را دریافت کنید.
        </p>
      </section>
    </div>
  );
};

export default Home;
